import jwt from 'jsonwebtoken';

//==============================================================================Функция проверки токена
export default (req, res, next) => { 
    const token = (req.headers.authorization || '').replace('Bearer ', '') || '';//======================================Получаем токен из заголовка запроса

    if(token){//===============================================================Если токен есть, то проверяем его
        try {
            const decoded = jwt.verify(token, 'secretKey');//=================Декодируем токен
            req.userId = decoded._id;//=================================================Сохраняем декодированный токен в объекте запроса
            next();
        } catch(err){
            return res.status(403).json({
                message: 'Неверный токен'
            });
        };
    } else {//==========================================Если токен не найден, то возвращаем ошибку
        return res.status(403).json({
            message: 'Нет доступа'
        });
    }
};